<?php

use App\Enums\PeperworkTypeEnum;

    return [
        'countries'=>[
          'list'=>'تم إرجاع قائمة البلدان بنجاح',
          'show'=>'تم إرجاع قائمة البلد بنجاح',
          'create'=>'تم ادخال قائمة البلد بنجاح',
          'update'=>'تم تعديل قائمة البلد بنجاح',
          'delete' => 'تم حذف البلد بنجاح' ,
          'not_create'=>'لم يتم انشاء البلد بنجاح',
          'not_update'=>'لم يتم تعديل البلد بنجاح',
          'not_delete'=>'لم يتم الغاء البلد بنجاح'
        ],


    'schools' => [
        'list'=>'قائمة المدارس تم إرجاعها بنجاح',
        'show'=> 'تم إرجاع المدارس بنجاح',
        'create' => 'تم إدخال المدارس بنجاح',
        'update' => 'تم تحديث المدرسة بنجاح',
        'delete' => 'تم حذف المدرسة بنجاح' ,
        'not_create'=>'لم يتم انشاء المدرسة بنجاح',
        'not_update'=>'لم يتم تعديل المدرسة بنجاح',
        'not_delete'=>'لم يتم الغاء المدرسة بنجاح',
        'level_assigned_school_success'=>'تم تعيين المستويات للمدرسة',
        'level_assigned_school_field'=>'تم تعيين المستويات للمدرسة',
        'level_term_list'=>'تم إرجاع المراحل والفصول بنجاح',
        'level_term_not_return_list'=>'لم يتم إرجاع المراحل والفصول بنجاح'
    ],

    'terms' => [
        'list' => 'قائمة الفصول الدراسية تم إرجاعها بنجاح',
        'show' => 'تم إرجاع الفصول الدراسية بنجاح',
        'create'=>'تم إدخال الفصول الدراسية بنجاح',
        'update'=>'تم تحديث الفصول الدراسية بنجاح',
        'delete'=>'تم الغاء الفصول الدراسية بنجاح',
        'not_create'=>'لم يتم انشاء الفصول الدراسية بنجاح',
        'not_update'=>'لم يتم تعديل الفصول الدراسية بنجاح',
        'not_delete'=>'لم يتم الغاء الفصول الدراسية بنجاح',

    ],

    'levels' => [
        'list' => 'قائمة المراحل الدراسية  تم إرجاعها بنجاح',
        'show' => 'تم إرجاع المرحلة الدراسية بنجاح',
        'create'=>'تم إدخال المرحلة الدراسية بنجاح',
        'update'=>'تم تحديث المرحلة الدراسية بنجاح',
        'delete'=>'تم الغاء المرحلة الدراسية بنجاح',
        'not_create'=>'لم يتم انشاء المرحلة الدراسية بنجاح',
        'not_update'=>'لم يتم تعديل المرحلة الدراسية بنجاح',
        'not_delete'=>'لم يتم الغاء المرحلة الدراسية بنجاح'
    ],

    'roles' => [
        'list' => 'قائمة الوظيفة تم إرجاعهابنجاح',
        'show' => 'تم إرجاع الوظيفة بنجاح',
        'create'=>'تم إدخال الوظيفة بنجاح',
        'update'=>'تم تحديث الوظيفة بنجاح',
        'delete'=>'تم الغاء الوظيفة بنجاح',
        'default_role_delete'=>'الوظيفة لم يتم حذفه ، الوظيفة افتراضية',
        'not_create'=>'لم يتم انشاء الوظيفة بنجاح',
        'not_update'=>'لم يتم تعديل الوظيفة بنجاح',
        'not_delete'=>'لم يتم الغاء الوظيفة بنجاح'
    ],

    'pacakges' => [
        'list' => 'قائمة الباقات تم إرجاعهابنجاح',
        'show' => 'تم إرجاع الباقة بنجاح',
        'create'=>'تم إدخال الباقة بنجاح',
        'update'=>'تم تحديث الباقة بنجاح',
        'delete'=>'تم الغاء الباقة بنجاح',
        'not_create'=>'لم يتم انشاء الباقة بنجاح',
        'not_update'=>'لم يتم تعديل الباقة بنجاح',
        'not_delete'=>'لم يتم الغاء الباقة بنجاح'
    ],

    'school_types' => [
        'list' => 'قائمة نوع المدرسة تم إرجاعهابنجاح',
        'show' => 'تم إرجاع نوع المدرسة بنجاح',
        'create'=>'تم إدخال نوع المدرسة بنجاح',
        'update'=>'تم تحديث نوع المدرسة بنجاح',
        'delete'=>'تم الغاء نوع المدرسة بنجاح',
        'not_create'=>'لم يتم انشاء نوع المدرسة بنجاح',
        'not_update'=>'لم يتم تعديل نوع المدرسة بنجاح',
        'not_delete'=>'لم يتم الغاء نوع المدرسة بنجاح',
        'types'=> [
            'national'=>'محلى',
            'international'=>'دولى'
        ]
    ],

    'classes' => [
        'list' => 'قائمة الصفوف الدراسية تم إرجاعهابنجاح',
        'show' => 'تم إرجاع الصفوف الدراسية بنجاح',
        'create'=>'تم إدخال الصفوف الدراسية بنجاح',
        'update'=>'تم تحديث الصفوف الدراسية بنجاح',
        'delete'=>'تم الغاء الصفوف الدراسية بنجاح',
        'classes_missions_num_filed'=>'آسف لم تصل البعثات إلى الحد الأدنى من العدد',
        'not_create'=>'لم يتم انشاء الصفوف الدراسية بنجاح',
        'not_update'=>'لم يتم تعديل الصفوف الدراسية بنجاح',
        'not_delete'=>'لم يتم الغاء الصفوف الدراسية بنجاح'
    ],


    'users' => [
        'list' => 'قائمة المستخدم تم إرجاعهابنجاح',
        'show' => 'تم إرجاع المستخدم بنجاح',
        'create'=>'تم إدخال المستخدم بنجاح',
        'update'=>'تم تحديث المستخدم بنجاح',
        'delete'=>'تم الغاء تحديث المستخدم بنجاح',
        'not_create'=>'لم يتم انشاء المستخدم بنجاح',
        'not_update'=>'لم يتم تعديل المستخدم بنجاح',
        'not_delete'=>'لم يتم الغاء المستخدم بنجاح'
    ],

    'learningpaths' => [
        'list' => 'قائمة مسارات التعلم تم إرجاعهابنجاح',
        'show' => 'تم إرجاع مسارات التعلم بنجاح',
        'create'=>'تم إدخال مسارات التعلم بنجاح',
        'update'=>'تم تحديث مسارات التعلم بنجاح',
        'delete'=>'تم الغاء مسارات التعلم بنجاح',
        'learningpath_status_change_success'=>' تغيير حالة مهمة مسار التعلم بنجاح',
        'learningpath_status_not_change_success'=>'لم يتم تغيير حالة مهمة مسار التعلم بنجاح',
        'not_create'=>'لم يتم انشاء مسارات التعلم بنجاح',
        'not_update'=>'لم يتم تعديل مسارات التعلم بنجاح',
        'not_delete'=>'لم يتم الغاء مسارات التعلم بنجاح'
    ],

    'videobanks' => [
        'list' => 'قائمة الفيديو تم إرجاعهابنجاح',
        'show' => 'تم إرجاع الفيديو بنجاح',
        'create'=>'تم إدخال الفيديو بنجاح',
        'update'=>'تم تحديث الفيديو بنجاح',
        'delete'=>'تم الغاء الفيديو بنجاح',
        'not_create'=>'لم يتم انشاء الفيديو بنجاح',
        'not_update'=>'لم يتم تعديل الفيديو بنجاح',
        'not_delete'=>'لم يتم الغاء الفيديو بنجاح'
    ],


    'questions' => [
        'list' => 'قائمة السؤال تم إرجاعهابنجاح',
        'show' => 'تم إرجاع السؤال بنجاح',
        'create'=>'تم إدخال السؤال بنجاح',
        'update'=>'تم تحديث السؤال بنجاح',
        'delete'=>'تم الغاء السؤال بنجاح',
        'not_create'=>'لم يتم انشاء السؤال بنجاح',
        'not_update'=>'لم يتم تعديل السؤال بنجاح',
        'not_delete'=>'لم يتم الغاء السؤال بنجاح'
    ],

    'school_groups' => [
        'list' => 'قائمة مجموعة المدرسة تم إرجاعهابنجاح',
        'show' => 'تم إرجاع مجموعة المدرسة بنجاح',
        'create'=>'تم إدخال مجموعة المدرسة بنجاح',
        'update'=>'تم تحديث مجموعة المدرسة بنجاح',
        'delete'=>'تم الغاء مجموعة المدرسة بنجاح',
        'not_create'=>'لم يتم انشاء مجموعة المدرسة بنجاح',
        'not_update'=>'لم يتم تعديل مجموعة المدرسة بنجاح',
        'not_delete'=>'لم يتم الغاء مجموعة المدرسة بنجاح'
    ],

    'questions_types' => [
        'list' => 'قائمة نوع السؤال تم إرجاعهابنجاح',
        'show' => 'تم إرجاع نوع السؤال بنجاح',
        'create'=>'تم إدخال نوع السؤال بنجاح',
        'update'=>'تم تحديث نوع السؤال بنجاح',
        'delete'=>'تم الغاء نوع السؤال بنجاح',
        'not_create'=>'لم يتم انشاء نوع السؤال بنجاح',
        'not_update'=>'لم يتم تعديل نوع السؤال بنجاح',
        'not_delete'=>'لم يتم الغاء نوع السؤال بنجاح'
    ],


    'questions_difficulties' => [
        'list' => 'قائمة صعوبة السؤال تم إرجاعهابنجاح',
        'show' => 'تم إرجاع صعوبة السؤال بنجاح',
        'create'=>'تم إدخال صعوبة السؤال بنجاح',
        'update'=>'تم تحديث صعوبة السؤال بنجاح',
        'delete'=>'تم الغاء صعوبة السؤال بنجاح',
        'not_create'=>'لم يتم انشاء صعوبة السؤال بنجاح',
        'not_update'=>'لم يتم تعديل صعوبة السؤال بنجاح',
        'not_delete'=>'لم يتم الغاء صعوبة السؤال بنجاح'
    ],

    'bloom_categories' => [
        'list' => 'قائمة فئة بلوم تم إرجاعهابنجاح',
        'show' => 'تم إرجاع فئة بلوم بنجاح',
        'create'=>'تم إدخال فئة بلوم بنجاح',
        'update'=>'تم تحديث فئة بلوم بنجاح',
        'delete'=>'تم الغاء فئة بلوم بنجاح',
        'not_create'=>'لم يتم انشاء فئة بلوم بنجاح',
        'not_update'=>'لم يتم تعديل فئة بلوم بنجاح',
        'not_delete'=>'لم يتم الغاء فئة بلوم بنجاح'
    ],


    'language_skills' => [
        'list' => 'قائمة مهارات اللغة تم إرجاعهابنجاح',
        'show' => 'تم إرجاع مهارات اللغة بنجاح',
        'create'=>'تم إدخال مهارات اللغة بنجاح',
        'update'=>'تم تحديث مهارات اللغة بنجاح',
        'delete'=>'تم الغاء مهارات بنجاح',
        'not_create'=>'لم يتم انشاء مهارات اللغة بنجاح',
        'not_update'=>'لم يتم تعديل مهارات اللغة بنجاح',
        'not_delete'=>'لم يتم الغاء مهارات اللغة بنجاح'
    ],

       'language_methods' => [
        'list' => 'قائمة طريقة اللغة تم إرجاعهابنجاح',
        'show' => 'تم إرجاع طريقة اللغة بنجاح',
        'create'=>'تم إدخال طريقة اللغة بنجاح',
        'update'=>'تم تحديث طريقة اللغة بنجاح',
        'delete'=>'تم الغاء طريقة اللغة بنجاح',
        'not_create'=>'لم يتم انشاء طريقة اللغة بنجاح',
        'not_update'=>'لم يتم تعديل طريقة اللغة بنجاح',
        'not_delete'=>'لم يتم الغاء طريقة اللغة بنجاح'
    ],

    'paper_works' => [
        'list' => 'قائمة اوراق العمل تم إرجاعهابنجاح',
        'show' => 'تم إرجاع اوراق العمل بنجاح',
        'create'=>'تم إدخال اوراق العمل بنجاح',
        'update'=>'تم تحديث اوراق العمل بنجاح',
        'delete'=>'تم الغاء اوراق العمل بنجاح',
        'not_create'=>'لم يتم انشاء اوراق العمل بنجاح',
        'not_update'=>'لم يتم تعديل اوراق العمل بنجاح',
        'not_delete'=>'لم يتم الغاء اوراق العمل بنجاح',
        'types' => [
            'participatory' =>'اوراق عمل تشاركية',
            'single' =>'اوراق عمل فردية',
        ],
    ],

    'missions' => [
        'list' => 'قائمة المهمة تم إرجاعهابنجاح',
        'show' => 'تم إرجاع المهمة بنجاح',
        'create'=>'تم إدخال المهمة بنجاح',
        'update'=>'تم تحديث المهمة بنجاح',
        'delete'=>'تم الغاء المهمة بنجاح',
        'list_contents'=>'تم ارجاع محتويات القائمة بنجاح',
        'selected_learningpath_content_success'=>'تم اختيار محتوى المهمة بنجاح',
        'selected_learningpath_content_error'=>'لم يتم اختيار محتوى المهمة بنجاح',
        'rearrange_success'=>'تم إعادة ترتيب المهمة بنجاح',
        'rearrange_error'=>'لم يتم إعادة ترتيب المهمة بنجاح',
        'not_create'=>'لم يتم انشاء المهمة بنجاح',
        'not_update'=>'لم يتم تعديل المهمة بنجاح',
        'not_delete'=>'لم يتم الغاء المهمة بنجاح'
    ],

    'quizzes' => [
        'list' => 'قائمة الإختبارات تم إرجاعهابنجاح',
        'show' => 'تم إرجاع الاختبار بنجاح',
        'create'=>'تم إدخال الاختبار بنجاح',
        'update'=>'تم تحديث الاختبار بنجاح',
        'delete'=>'تم الغاء الاختبار بنجاح',
        'not_create'=>'لم يتم انشاء الاختبار بنجاح',
        'not_update'=>'لم يتم تعديل الاختبار بنجاح',
        'not_delete'=>'لم يتم الغاء الاختبار بنجاح',
        'types'=>[
            'default'=>'افتراضى',
            'manual'=>'يدوى',
            'automatic'=>'اتوماتيك',
        ]
    ],

    'enrollments' => [
        'list' => 'قائمة تسجيل الموظف تم إرجاعهابنجاح',
        'show' => 'تم إرجاع تسجيل الموظف بنجاح',
        'create'=>'تم إدخال تسجيل الموظف بنجاح',
        'update'=>'تم تحديث تسجيل الموظف بنجاح',
        'delete'=>'تم الغاء تسجيل الموظف بنجاح',
        'not_create'=>'لم يتم انشاء تسجيل الموظف بنجاح',
        'not_update'=>'لم يتم تعديل تسجيل الموظف بنجاح',
        'not_delete'=>'لم يتم الغاء تسجيل الموظف بنجاح'
    ],

    'student_enrollments' => [
        'list' => 'قائمة تسجيل الطالب تم إرجاعهابنجاح',
        'show' => 'تم إرجاع تسجيل الطالب بنجاح',
        'create'=>'تم إدخال تسجيل الطالب بنجاح',
        'update'=>'تم تحديث تسجيل الطالب بنجاح',
        'delete'=>'تم الغاء تسجيل الطالب بنجاح',
        'not_create'=>'لم يتم انشاء تسجيل الطالب بنجاح',
        'not_update'=>'لم يتم تعديل تسجيل الطالب بنجاح',
        'not_delete'=>'لم يتم الغاء تسجيل الطالب بنجاح'
    ],


];
