<?php
    return [
          'login_success'=>'تم الدخول الى النظام بنجاح',
          'login_failed'=>'لم يتم الدخول الى النظام بنجاح',
          'login_block'=>'تم حظر حسابك ؛ يرجى تغيير كلمة المرور الخاصة بك لتسجيل الدخول إلى حسابك',
          'login_deactivated'=>'تم إلغاء تنشيط حسابك ، يرجى الاتصال بالمسؤول للحصول على مزيد من المعلومات.',
          'login_verify'=>'تحتاج إلى التحقق من بريدك الإلكتروني حتى تتمكن من تسجيل الدخول',
          'login_not_exists'=>'تركيبة اسم المستخدم وكلمة المرور غير موجودة',
          'failed' => 'بيانات الاعتماد هذه لا تطابق سجلاتنا.',
          'password' => 'كلمة المرور المقدمة غير صحيحة.',
          'throttle' => 'محاولات تسجيل دخول كثيرة جدًا. يرجى المحاولة مرة أخرى خلال: ثواني. ',

];
